package part_3.collections.date.HomeWork;

public class HomeWork {

    /* Посчитать время работы метода set в LinkedList и ArrayList /*
/* Посчитать время работы метода remove в LinkedList и ArrayList /*
/*
1. Создай список строк.
2. Добавь в него 5 строчек с клавиатуры.
3. Удали последнюю строку и вставь её в начало. Повторить 5 раз.
4. Используя цикл выведи содержимое на экран, каждое значение с новой строки.
*/
/*
Введи с клавиатуры 5 слов в список строк. Удали 3 - ий элемент списка, и выведи оставшиеся элементы в обратном порядке. */
/*
1. Создай список слов, заполни его самостоятельно.
2. Метод fix должен:
2.1. удалять из списка строк все слова, содержащие букву «р»
2.2. удваивать все слова содержащие букву «л».
2.3. если слово содержит и букву «р» и букву «л», то оставить это слово без изменений.
2.4. с другими словами ничего не делать.
Пример:
лира
лоза
роза
Выходные данные:
лира
лоза
лоза
*/








/*
1. Введи с клавиатуры 5 слов в список строк.
2. Метод doubleValues должен удваивать слова по принципу a,b,c -> a,a,b,b,c,c.
3. Используя цикл for выведи результат на экран, каждое значение с новой строки.
Пример:
краб
лось
рак
Выходные данные:
краб краб
лось лось
рак рак
*/
/*
Задача: Программа вводит с клавиатуры данные про котов и выводит их на экран.
Создать класс Cat с параметрами name, age, weight, tail;
Переопределить метод toString() в классе Cat, что бы он выводил информацию про кота в виде: "Cat name is " + name + ", age is " + age + ", weight is " + weight + ", tail = " + tailLength; Вводить параметры с клавиатуры и создавать объект с введенными параметрами.
Ввод продолжается, пока переменная с именем не пуста.
Добавлять каждый объект в список, в конце вывести содержимое списка на экран.
Пример:
Cat name is Barsik, age is 6, weight is 5, tail = 22
Cat name is Murka, age is 8, weight is 7, tail = 20
*/

}
