package part_3.collections.map.homeWork;

public class HomeWork {
    public static void main(String[] args) {

        /*
1. Ввести с клавиатуры число N.
2. Считать N целых чисел и заполнить ими список - метод getIntegerList.
3. Найти минимальное число среди элементов списка - метод getMinimum.
*/
/*
1. Создай класс Human с полями имя (String), пол (boolean), возраст (int), дети (ArrayList<Human>).
2. Создай объекты и заполни их так, чтобы получилось: два дедушки, две бабушки, отец, мать, трое детей.
3. Вывести все объекты Human на экран.
Имя: ded Ivan, пол: мужской, возраст: 70, дети: papa Fedya
Имя: baba Masha, пол: женский, возраст: 65, дети: papa Fedya
Имя: papa Fedya, пол: мужской, возраст: 40, дети: son Lesha, son Misha, daughter Masha
*/
        /* Создать массив на 10 чисел. Заполнить его числами с клавиатуры. Вывести пять наибольших чисел.
         */
        /* Ввести с клавиатуры 5 слов и выведи их в алфавитном порядке. */
/*
Создать коллекцию HashMap<String, String>, занести туда 4 пары строк
Вывести содержимое коллекции на экран, каждый элемент с новой строки.
Пример вывода:
ключ - значение
ключ - значение
ключ - значение
ключ - значение
*/
/* Есть коллекция HashMap<String, String>, туда занесли 3 различные пары. При помощи метода printKeys:
Вывести на экран список ключей, каждый элемент с новой строки. */
/* Есть коллекция HashMap<String, String>, туда занесли 3 различные пары. При помощи метода printValues:
Вывести на экран список значений, каждый элемент с новой строки. */
        /* Удалить все числа больше 10 Создать множество чисел (Set<Integer>), занести туда 5 различных чисел. При помощи метода removeAllNumbersMoreThan10 удалить из множества все числа больше 10. */

    }
}
