package part_5.javaCore.recursion.homeWork;

public class HomeWork {
    /*
Задача по алгоритмам. Найти ряд Фиббоначи для числа 10
*/
/*
Задача по алгоритмам.
Реализовать алгоритм бинарного поиска (загугли, разберись что это и реализуй)
*/
/*
Ввести с клавиатуры в список 5 слов.
Нужно подсчитать количество одинаковых слов в списке.
Результат нужно представить в виде словаря Map<String, Integer>, где первый параметр – уникальная строка, а второй – число, сколько раз данная строка встречалась в списке. Вывести содержимое словаря на экран.
*/

}
