package part_1.loops.homeWork;

public class HomeWork {
    public static void main(String[] args) {


        /* Вывести на экран числа от 1 до 10 используя цикл while. */
        /* Вывести на экран числа от 10 до 1 используя цикл while. */
/*
Используя цикл for вывести на экран чётные числа от 1 до 100 включительно.
Через пробел либо с новой строки.
*/
/*
Ввести с клавиатуры строку и число N. Вывести на экран строку N раз используя цикл while.
Пример ввода: pro 2
Пример вывода: pro pro
*/
/*
Ввести с клавиатуры два числа m и n. Используя цикл for вывести на экран прямоугольник размером m на n из восьмёрок.
Пример:
m=2, n=4
8888
8888
*/
        /* Вывести на экран квадрат 10х10 из букв P используя цикл while. */
        /* Вводить с клавиатуры числа и считать их сумму. Если пользователь ввел -1, вывести на экран сумму и завершить программу. -1 должно учитываться в сумме. */

    }
}
