package part_3.collections.list.homeWork;

public class HomeWork {

    /*
Создать список из чисел и заполнить его на 5 элементов с консоли
Вывести все элементы списка в консоль
*/
/*
1. Создай список строк.
2. Добавь в него 5 различных строчек с консоли.
3. Выведи его размер на экран.
4. Используя цикл выведи его содержимое на экран, каждое значение с новой строки.
*/
/*
Создать список из целых чисел и заполнить его с консоли
Ввод целых чисел с клавиатуры продолжается, пока не ввели пустую строку в консоли
После того, как ввод завершён - вывести все элементы списка в консоль
*/
/*
Создать список чисел и заполнить его с консоли следующим образом: чётные числа добавляют в конец списка, нечётные — в начало.
*/
/*
Создать список чисел и заполнить его с консоли
Удалить все числа больше 5
*/
/*
Создать список чисел и заполнить его с консоли
Разбить список на два других: - в первый список сохранять чётные числа - во второй список сохранять нечётные числа
Вывести содержимое всех списков в консоль. Каждый новый список выводить с новой строки, в ряд.
*/






/*
1. Создай список строк.
2. Считай с клавиатуры 5 строк и добавь в список.
3. Используя цикл, найди самую длинную строку в списке.
4. Выведи найденную строку на экран.
5. Если таких строк несколько, выведи каждую с новой строки.
*/
/*
1. Создай список строк.
2. Считай с клавиатуры 5 строк и добавь в список.
3. Используя цикл, найди самую короткую строку в списке.
4. Выведи найденную строку на экран.
5. Если таких строк несколько, выведи каждую с новой строки.
*/
/*
1. Введи с клавиатуры 6 чисел, сохрани их в список и рассортируй по трём другим спискам: Число делится на 3 (x%3==0), делится на 2 (x%2==0) и все остальные. Числа, которые делятся на 3 и на 2 одновременно, например 6, попадают в оба списка.
2. Создай метод printList - он должен выводить на экран все элементы списка с новой строки. 3. Используя метод printList выведи эти три списка на экран.
Сначала тот, который для x%3, потом тот, который для x%2, потом последний.
*/

}
